CSI API ETABS v1
cTendonObj.GetNameListOnStory Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetNameListOnStory(
	string StoryName,
	ref int NumberNames,
	ref string[] MyName
)
Function GetNameListOnStory (
	StoryName As String,
	ByRef NumberNames As Integer,
	ByRef MyName As String()
) As Integer
Dim instance As cTendonObj
Dim StoryName As String
Dim NumberNames As Integer
Dim MyName As String()
Dim returnValue As Integer
returnValue = instance.GetNameListOnStory(StoryName,
	NumberNames, MyName)
int GetNameListOnStory(
	String^ StoryName,
	int% NumberNames,
	array<String^>^% MyName
)
abstract GetNameListOnStory :
        StoryName : string *
        NumberNames : int byref *
        MyName : string[] byref -> int
Parameters
StoryName
Type: System.String
NumberNames
Type: System.Int32
MyName
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cTendonObj Interface
ETABSv1 Namespace